trol73/avr-make/asm/include/ATxmega64B3def.inc
.equ ADCB_CTRLA = 576		// Control Register A
.equ ADCB_CTRLB = 577		// Control Register B
.equ ADCB_REFCTRL = 578		// Reference Control
.equ ADCB_EVCTRL = 579		// Event Control
.equ ADCB_PRESCALER = 580		// Clock Prescaler
.equ ADCB_INTFLAGS = 582		// Interrupt Flags
.equ ADCB_TEMP = 583		// Temporary Register
.equ ADCB_SAMPCTRL = 584		// ADC Sampling Time Control Register
.equ ADCB_CAL = 588		// Calibration Value
.equ ADCB_CH0RES = 592		// Channel 0 Result
.equ ADCB_CMP = 600		// Compare Value
.equ ADCB_CH0_CTRL = 608		// Control Register
.equ ADCB_CH0_MUXCTRL = 609		// MUX Control
.equ ADCB_CH0_INTCTRL = 610		// Channel Interrupt Control Register
.equ ADCB_CH0_INTFLAGS = 611		// Interrupt Flags
.equ ADCB_CH0_RES = 612		// Channel Result
.equ ADCB_CH0_SCAN = 614		// Input Channel Scan

;***************************************************************************
;** ACB - Analog Comparator B
;***************************************************************************
	
.equ ACB_AC0CTRL = 912		// Analog Comparator 0 Control
.equ ACB_AC1CTRL = 913		// Analog Comparator 1 Control
.equ ACB_AC0MUXCTRL = 914		// Analog Comparator 0 MUX Control
.equ ACB_AC1MUXCTRL = 915		// Analog Comparator 1 MUX Control
.equ ACB_CTRLA = 916		// Control Register A
.equ ACB_CTRLB = 917		// Control Register B
.equ ACB_WINCTRL = 918		// Window Mode Control
.equ ACB_STATUS = 919		// Status
.equ ACB_CURRCTRL = 920		// Current Source Control Register
.equ ACB_CURRCALIB = 921		// Current Source Calibration Register

;***************************************************************************
;** RTC - Real-Time Counter
;***************************************************************************
	
.equ RTC_CTRL = 1024		// Control Register
.equ RTC_STATUS = 1025		// Status Register
.equ RTC_INTCTRL = 1026		// Interrupt Control Register
.equ RTC_INTFLAGS = 1027		// Interrupt Flags
.equ RTC_TEMP = 1028		// Temporary register
.equ RTC_CNT = 1032		// Count Register
.equ RTC_PER = 1034		// Period Register
.equ RTC_COMP = 1036		// Compare Register

;***************************************************************************
;** TWIC - Two-Wire Interface C
;***************************************************************************
	
.equ TWIC_CTRL = 1152		// TWI Common Control Register
.equ TWIC_MASTER_CTRLA = 1153		// Control Register A
.equ TWIC_MASTER_CTRLB = 1154		// Control Register B
.equ TWIC_MASTER_CTRLC = 1155		// Control Register C
.equ TWIC_MASTER_STATUS = 1156		// Status Register
.equ TWIC_MASTER_BAUD = 1157		// Baurd Rate Control Register
.equ TWIC_MASTER_ADDR = 1158		// Address Register
.equ TWIC_MASTER_DATA = 1159		// Data Register
.equ TWIC_SLAVE_CTRLA = 1160		// Control Register A
.equ TWIC_SLAVE_CTRLB = 1161		// Control Register B
.equ TWIC_SLAVE_STATUS = 1162		// Status Register
.equ TWIC_SLAVE_ADDR = 1163		// Address Register
.equ TWIC_SLAVE_DATA = 1164		// Data Register
.equ TWIC_SLAVE_ADDRMASK = 1165		// Address Mask Register

;***************************************************************************
;** USB - Universal Serial Bus Module
;***************************************************************************
	
.equ USB_CTRLA = 1216		// Control Register A
.equ USB_CTRLB = 1217		// Control Register B
.equ USB_STATUS = 1218		// Status Register
.equ USB_ADDR = 1219		// Address Register
.equ USB_FIFOWP = 1220		// FIFO Write Pointer Register
.equ USB_FIFORP = 1221		// FIFO Read Pointer Register
.equ USB_EPPTR = 1222		// Endpoint Configuration Table Pointer
.equ USB_INTCTRLA = 1224		// Interrupt Control Register A
.equ USB_INTCTRLB = 1225		// Interrupt Control Register B
.equ USB_INTFLAGSACLR = 1226		// Clear Interrupt Flag Register A
.equ USB_INTFLAGSASET = 1227		// Set Interrupt Flag Register A
.equ USB_INTFLAGSBCLR = 1228		// Clear Interrupt Flag Register B
.equ USB_INTFLAGSBSET = 1229		// Set Interrupt Flag Register B
.equ USB_CAL0 = 1274		// Calibration Byte 0
.equ USB_CAL1 = 1275		// Calibration Byte 1

;***************************************************************************
;** PORTB - I/O Port B
;***************************************************************************
	
.equ PORTB_DIR = 1568		// I/O Port Data Direction
.equ PORTB_DIRSET = 1569		// I/O Port Data Direction Set
.equ PORTB_DIRCLR = 1570		// I/O Port Data Direction Clear
.equ PORTB_DIRTGL = 1571		// I/O Port Data Direction Toggle
.equ PORTB_OUT = 1572		// I/O Port Output
.equ PORTB_OUTSET = 1573		// I/O Port Output Set
.equ PORTB_OUTCLR = 1574		// I/O Port Output Clear
.equ PORTB_OUTTGL = 1575		// I/O Port Output Toggle
.equ PORTB_IN = 1576		// I/O port Input
.equ PORTB_INTCTRL = 1577		// Interrupt Control Register
.equ PORTB_INT0MASK = 1578		// Port Interrupt 0 Mask
.equ PORTB_INT1MASK = 1579		// Port Interrupt 1 Mask
.equ PORTB_INTFLAGS = 1580		// Interrupt Flag Register
.equ PORTB_REMAP = 1582		// I/O Port Pin Remap Register
.equ PORTB_PIN0CTRL = 1584		// Pin 0 Control Register
.equ PORTB_PIN1CTRL = 1585		// Pin 1 Control Register
.equ PORTB_PIN2CTRL = 1586		// Pin 2 Control Register
.equ PORTB_PIN3CTRL = 1587		// Pin 3 Control Register
.equ PORTB_PIN4CTRL = 1588		// Pin 4 Control Register
.equ PORTB_PIN5CTRL = 1589		// Pin 5 Control Register
.equ PORTB_PIN6CTRL = 1590		// Pin 6 Control Register
.equ PORTB_PIN7CTRL = 1591		// Pin 7 Control Register

;***************************************************************************
;** PORTC - I/O Port C
;***************************************************************************
	
.equ PORTC_DIR = 1600		// I/O Port Data Direction
.equ PORTC_DIRSET = 1601		// I/O Port Data Direction Set
.equ PORTC_DIRCLR = 1602		// I/O Port Data Direction Clear
.equ PORTC_DIRTGL = 1603		// I/O Port Data Direction Toggle
.equ PORTC_OUT = 1604		// I/O Port Output
.equ PORTC_OUTSET = 1605		// I/O Port Output Set
.equ PORTC_OUTCLR = 1606		// I/O Port Output Clear
.equ PORTC_OUTTGL = 1607		// I/O Port Output Toggle
.equ PORTC_IN = 1608		// I/O port Input
.equ PORTC_INTCTRL = 1609		// Interrupt Control Register
.equ PORTC_INT0MASK = 1610		// Port Interrupt 0 Mask
.equ PORTC_INT1MASK = 1611		// Port Interrupt 1 Mask
.equ PORTC_INTFLAGS = 1612		// Interrupt Flag Register
.equ PORTC_REMAP = 1614		// I/O Port Pin Remap Register
.equ PORTC_PIN0CTRL = 1616		// Pin 0 Control Register
.equ PORTC_PIN1CTRL = 1617		// Pin 1 Control Register
.equ PORTC_PIN2CTRL = 1618		// Pin 2 Control Register
.equ PORTC_PIN3CTRL = 1619		// Pin 3 Control Register
.equ PORTC_PIN4CTRL = 1620		// Pin 4 Control Register
.equ PORTC_PIN5CTRL = 1621		// Pin 5 Control Register
.equ PORTC_PIN6CTRL = 1622		// Pin 6 Control Register
.equ PORTC_PIN7CTRL = 1623		// Pin 7 Control Register

;***************************************************************************
;** PORTD - I/O Port D
;***************************************************************************
	
.equ PORTD_DIR = 1632		// I/O Port Data Direction
.equ PORTD_DIRSET = 1633		// I/O Port Data Direction Set
.equ PORTD_DIRCLR = 1634		// I/O Port Data Direction Clear
.equ PORTD_DIRTGL = 1635		// I/O Port Data Direction Toggle
.equ PORTD_OUT = 1636		// I/O Port Output
.equ PORTD_OUTSET = 1637		// I/O Port Output Set
.equ PORTD_OUTCLR = 1638		// I/O Port Output Clear
.equ PORTD_OUTTGL = 1639		// I/O Port Output Toggle
.equ PORTD_IN = 1640		// I/O port Input
.equ PORTD_INTCTRL = 1641		// Interrupt Control Register
.equ PORTD_INT0MASK = 1642		// Port Interrupt 0 Mask
.equ PORTD_INT1MASK = 1643		// Port Interrupt 1 Mask
.equ PORTD_INTFLAGS = 1644		// Interrupt Flag Register
.equ PORTD_REMAP = 1646		// I/O Port Pin Remap Register
.equ PORTD_PIN0CTRL = 1648		// Pin 0 Control Register
.equ PORTD_PIN1CTRL = 1649		// Pin 1 Control Register
.equ PORTD_PIN2CTRL = 1650		// Pin 2 Control Register
.equ PORTD_PIN3CTRL = 1651		// Pin 3 Control Register
.equ PORTD_PIN4CTRL = 1652		// Pin 4 Control Register
.equ PORTD_PIN5CTRL = 1653		// Pin 5 Control Register
.equ PORTD_PIN6CTRL = 1654		// Pin 6 Control Register
.equ PORTD_PIN7CTRL = 1655		// Pin 7 Control Register

;***************************************************************************
;** PORTG - I/O Port G
;***************************************************************************
	
.equ PORTG_DIR = 1728		// I/O Port Data Direction
.equ PORTG_DIRSET = 1729		// I/O Port Data Direction Set
.equ PORTG_DIRCLR = 1730		// I/O Port Data Direction Clear
.equ PORTG_DIRTGL = 1731		// I/O Port Data Direction Toggle
.equ PORTG_OUT = 1732		// I/O Port Output
.equ PORTG_OUTSET = 1733		// I/O Port Output Set
.equ PORTG_OUTCLR = 1734		// I/O Port Output Clear
.equ PORTG_OUTTGL = 1735		// I/O Port Output Toggle
.equ PORTG_IN = 1736		// I/O port Input
.equ PORTG_INTCTRL = 1737		// Interrupt Control Register
.equ PORTG_INT0MASK = 1738		// Port Interrupt 0 Mask
.equ PORTG_INT1MASK = 1739		// Port Interrupt 1 Mask
.equ PORTG_INTFLAGS = 1740		// Interrupt Flag Register
.equ PORTG_REMAP = 1742		// I/O Port Pin Remap Register
.equ PORTG_PIN0CTRL = 1744		// Pin 0 Control Register
.equ PORTG_PIN1CTRL = 1745		// Pin 1 Control Register
.equ PORTG_PIN2CTRL = 1746		// Pin 2 Control Register
.equ PORTG_PIN3CTRL = 1747		// Pin 3 Control Register
.equ PORTG_PIN4CTRL = 1748		// Pin 4 Control Register
.equ PORTG_PIN5CTRL = 1749		// Pin 5 Control Register
.equ PORTG_PIN6CTRL = 1750		// Pin 6 Control Register
.equ PORTG_PIN7CTRL = 1751		// Pin 7 Control Register

;***************************************************************************
;** PORTM - I/O Port M
;***************************************************************************
	
