trol73/avr-make/asm/include/ATxmega64B3def.inc
; LCD_CTRLF masks
.equ LCD_FCONT_gm = 0x3F ; Fine Contrast group mask
.equ LCD_FCONT_gp = 0 ; Fine Contrast group position
.equ LCD_FCONT0_bm = (1<<0) ; Fine Contrast bit 0 mask
.equ LCD_FCONT0_bp = 0 ; Fine Contrast bit 0 position
.equ LCD_FCONT1_bm = (1<<1) ; Fine Contrast bit 1 mask
.equ LCD_FCONT1_bp = 1 ; Fine Contrast bit 1 position
.equ LCD_FCONT2_bm = (1<<2) ; Fine Contrast bit 2 mask
.equ LCD_FCONT2_bp = 2 ; Fine Contrast bit 2 position
.equ LCD_FCONT3_bm = (1<<3) ; Fine Contrast bit 3 mask
.equ LCD_FCONT3_bp = 3 ; Fine Contrast bit 3 position
.equ LCD_FCONT4_bm = (1<<4) ; Fine Contrast bit 4 mask
.equ LCD_FCONT4_bp = 4 ; Fine Contrast bit 4 position
.equ LCD_FCONT5_bm = (1<<5) ; Fine Contrast bit 5 mask
.equ LCD_FCONT5_bp = 5 ; Fine Contrast bit 5 position

; LCD_CTRLG masks
.equ LCD_TDG_gm = 0xC0 ; Type of Digit group mask
.equ LCD_TDG_gp = 6 ; Type of Digit group position
.equ LCD_TDG0_bm = (1<<6) ; Type of Digit bit 0 mask
.equ LCD_TDG0_bp = 6 ; Type of Digit bit 0 position
.equ LCD_TDG1_bm = (1<<7) ; Type of Digit bit 1 mask
.equ LCD_TDG1_bp = 7 ; Type of Digit bit 1 position
.equ LCD_STSEG_gm = 0x3F ; Start Segment group mask
.equ LCD_STSEG_gp = 0 ; Start Segment group position
.equ LCD_STSEG0_bm = (1<<0) ; Start Segment bit 0 mask
.equ LCD_STSEG0_bp = 0 ; Start Segment bit 0 position
.equ LCD_STSEG1_bm = (1<<1) ; Start Segment bit 1 mask
.equ LCD_STSEG1_bp = 1 ; Start Segment bit 1 position
.equ LCD_STSEG2_bm = (1<<2) ; Start Segment bit 2 mask
.equ LCD_STSEG2_bp = 2 ; Start Segment bit 2 position
.equ LCD_STSEG3_bm = (1<<3) ; Start Segment bit 3 mask
.equ LCD_STSEG3_bp = 3 ; Start Segment bit 3 position
.equ LCD_STSEG4_bm = (1<<4) ; Start Segment bit 4 mask
.equ LCD_STSEG4_bp = 4 ; Start Segment bit 4 position
.equ LCD_STSEG5_bm = (1<<5) ; Start Segment bit 5 mask
.equ LCD_STSEG5_bp = 5 ; Start Segment bit 5 position

; LCD_CTRLH masks
.equ LCD_DEC_bm = 0x80 ; Decrement of Start Segment bit mask
.equ LCD_DEC_bp = 7 ; Decrement of Start Segment bit position
.equ LCD_DCODE_gm = 0x7F ; Display Code group mask
.equ LCD_DCODE_gp = 0 ; Display Code group position
.equ LCD_DCODE0_bm = (1<<0) ; Display Code bit 0 mask
.equ LCD_DCODE0_bp = 0 ; Display Code bit 0 position
.equ LCD_DCODE1_bm = (1<<1) ; Display Code bit 1 mask
.equ LCD_DCODE1_bp = 1 ; Display Code bit 1 position
.equ LCD_DCODE2_bm = (1<<2) ; Display Code bit 2 mask
.equ LCD_DCODE2_bp = 2 ; Display Code bit 2 position
.equ LCD_DCODE3_bm = (1<<3) ; Display Code bit 3 mask
.equ LCD_DCODE3_bp = 3 ; Display Code bit 3 position
.equ LCD_DCODE4_bm = (1<<4) ; Display Code bit 4 mask
.equ LCD_DCODE4_bp = 4 ; Display Code bit 4 position
.equ LCD_DCODE5_bm = (1<<5) ; Display Code bit 5 mask
.equ LCD_DCODE5_bp = 5 ; Display Code bit 5 position
.equ LCD_DCODE6_bm = (1<<6) ; Display Code bit 6 mask
.equ LCD_DCODE6_bp = 6 ; Display Code bit 6 position
 
; LCD Blink Rate
.equ LCD_BLINKRATE_4Hz_gc = (0x00<<0) ; 4Hz Blink Rate
.equ LCD_BLINKRATE_2Hz_gc = (0x01<<0) ; 2Hz Blink Rate
.equ LCD_BLINKRATE_1Hz_gc = (0x02<<0) ; 1Hz Blink Rate
.equ LCD_BLINKRATE_0Hz5_gc = (0x03<<0) ; 0.5Hz Blink Rate

; LCD Clock Divide
.equ LCD_CLKDIV_DivBy1_gc = (0x00<<4) ; frame rate of 256 Hz
.equ LCD_CLKDIV_DivBy2_gc = (0x01<<4) ; frame rate of 128 Hz
.equ LCD_CLKDIV_DivBy3_gc = (0x02<<4) ; frame rate of 83.5 Hz
.equ LCD_CLKDIV_DivBy4_gc = (0x03<<4) ; frame rate of 64 Hz
.equ LCD_CLKDIV_DivBy5_gc = (0x04<<4) ; frame rate of 51.2 Hz
.equ LCD_CLKDIV_DivBy6_gc = (0x05<<4) ; frame rate of 42.7 Hz
.equ LCD_CLKDIV_DivBy7_gc = (0x06<<4) ; frame rate of 36.6 Hz
.equ LCD_CLKDIV_DivBy8_gc = (0x07<<4) ; frame rate of 32 Hz

; Duty Select
.equ LCD_DUTY_1_4_gc = (0x00<<0) ; Duty=1/4, Bias=1/3, COM0:3
.equ LCD_DUTY_Static_gc = (0x01<<0) ; Duty=Static, Bias=Static, COM0
.equ LCD_DUTY_1_2_gc = (0x02<<0) ; Duty=1/2, Bias=1/3, COM0:1
.equ LCD_DUTY_1_3_gc = (0x03<<0) ; Duty=1/3, Bias=1/3, COM0:2

; LCD Prescaler Select
.equ LCD_PRESC_8_gc = (0x00<<7) ; clk_lcd/8
.equ LCD_PRESC_16_gc = (0x01<<7) ; clk_lcd/16

; Type of Digit
.equ LCD_TDG_7S_3C_gc = (0x00<<6) ; 7-segment with 3 COMs
.equ LCD_TDG_7S_4C_gc = (0x01<<6) ; 7-segment with 4 COMs
.equ LCD_TDG_14S_4C_gc = (0x02<<6) ; 14-segment with 4 COMs
.equ LCD_TDG_16S_3C_gc = (0x03<<6) ; 16-segment with 3 COMs


;***************************************************************************
;** FUSE - Fuses and Lockbits
;***************************************************************************/

; NVM_LOCKBITS_LOCKBITS masks
.equ NVM_LOCKBITS_BLBB_gm = 0xC0 ; Boot Lock Bits - Boot Section group mask
.equ NVM_LOCKBITS_BLBB_gp = 6 ; Boot Lock Bits - Boot Section group position
.equ NVM_LOCKBITS_BLBB0_bm = (1<<6) ; Boot Lock Bits - Boot Section bit 0 mask
.equ NVM_LOCKBITS_BLBB0_bp = 6 ; Boot Lock Bits - Boot Section bit 0 position
.equ NVM_LOCKBITS_BLBB1_bm = (1<<7) ; Boot Lock Bits - Boot Section bit 1 mask
.equ NVM_LOCKBITS_BLBB1_bp = 7 ; Boot Lock Bits - Boot Section bit 1 position
.equ NVM_LOCKBITS_BLBA_gm = 0x30 ; Boot Lock Bits - Application Section group mask
.equ NVM_LOCKBITS_BLBA_gp = 4 ; Boot Lock Bits - Application Section group position
.equ NVM_LOCKBITS_BLBA0_bm = (1<<4) ; Boot Lock Bits - Application Section bit 0 mask
.equ NVM_LOCKBITS_BLBA0_bp = 4 ; Boot Lock Bits - Application Section bit 0 position
.equ NVM_LOCKBITS_BLBA1_bm = (1<<5) ; Boot Lock Bits - Application Section bit 1 mask
.equ NVM_LOCKBITS_BLBA1_bp = 5 ; Boot Lock Bits - Application Section bit 1 position
.equ NVM_LOCKBITS_BLBAT_gm = 0x0C ; Boot Lock Bits - Application Table group mask
.equ NVM_LOCKBITS_BLBAT_gp = 2 ; Boot Lock Bits - Application Table group position
.equ NVM_LOCKBITS_BLBAT0_bm = (1<<2) ; Boot Lock Bits - Application Table bit 0 mask
.equ NVM_LOCKBITS_BLBAT0_bp = 2 ; Boot Lock Bits - Application Table bit 0 position
.equ NVM_LOCKBITS_BLBAT1_bm = (1<<3) ; Boot Lock Bits - Application Table bit 1 mask
.equ NVM_LOCKBITS_BLBAT1_bp = 3 ; Boot Lock Bits - Application Table bit 1 position
.equ NVM_LOCKBITS_LB_gm = 0x03 ; Lock Bits group mask
.equ NVM_LOCKBITS_LB_gp = 0 ; Lock Bits group position
.equ NVM_LOCKBITS_LB0_bm = (1<<0) ; Lock Bits bit 0 mask
.equ NVM_LOCKBITS_LB0_bp = 0 ; Lock Bits bit 0 position
.equ NVM_LOCKBITS_LB1_bm = (1<<1) ; Lock Bits bit 1 mask
.equ NVM_LOCKBITS_LB1_bp = 1 ; Lock Bits bit 1 position

; NVM_FUSES_FUSEBYTE0 masks
.equ NVM_FUSES_JTAGUSERID_gm = 0xFF ; JTAG User ID group mask
.equ NVM_FUSES_JTAGUSERID_gp = 0 ; JTAG User ID group position
.equ NVM_FUSES_JTAGUSERID0_bm = (1<<0) ; JTAG User ID bit 0 mask
.equ NVM_FUSES_JTAGUSERID0_bp = 0 ; JTAG User ID bit 0 position
.equ NVM_FUSES_JTAGUSERID1_bm = (1<<1) ; JTAG User ID bit 1 mask
.equ NVM_FUSES_JTAGUSERID1_bp = 1 ; JTAG User ID bit 1 position
.equ NVM_FUSES_JTAGUSERID2_bm = (1<<2) ; JTAG User ID bit 2 mask
.equ NVM_FUSES_JTAGUSERID2_bp = 2 ; JTAG User ID bit 2 position
.equ NVM_FUSES_JTAGUSERID3_bm = (1<<3) ; JTAG User ID bit 3 mask
.equ NVM_FUSES_JTAGUSERID3_bp = 3 ; JTAG User ID bit 3 position
.equ NVM_FUSES_JTAGUSERID4_bm = (1<<4) ; JTAG User ID bit 4 mask
.equ NVM_FUSES_JTAGUSERID4_bp = 4 ; JTAG User ID bit 4 position
.equ NVM_FUSES_JTAGUSERID5_bm = (1<<5) ; JTAG User ID bit 5 mask
.equ NVM_FUSES_JTAGUSERID5_bp = 5 ; JTAG User ID bit 5 position
.equ NVM_FUSES_JTAGUSERID6_bm = (1<<6) ; JTAG User ID bit 6 mask
.equ NVM_FUSES_JTAGUSERID6_bp = 6 ; JTAG User ID bit 6 position
.equ NVM_FUSES_JTAGUSERID7_bm = (1<<7) ; JTAG User ID bit 7 mask
.equ NVM_FUSES_JTAGUSERID7_bp = 7 ; JTAG User ID bit 7 position

; NVM_FUSES_FUSEBYTE1 masks
.equ NVM_FUSES_WDWP_gm = 0xF0 ; Watchdog Window Timeout Period group mask
.equ NVM_FUSES_WDWP_gp = 4 ; Watchdog Window Timeout Period group position
.equ NVM_FUSES_WDWP0_bm = (1<<4) ; Watchdog Window Timeout Period bit 0 mask
.equ NVM_FUSES_WDWP0_bp = 4 ; Watchdog Window Timeout Period bit 0 position
.equ NVM_FUSES_WDWP1_bm = (1<<5) ; Watchdog Window Timeout Period bit 1 mask
.equ NVM_FUSES_WDWP1_bp = 5 ; Watchdog Window Timeout Period bit 1 position
.equ NVM_FUSES_WDWP2_bm = (1<<6) ; Watchdog Window Timeout Period bit 2 mask
.equ NVM_FUSES_WDWP2_bp = 6 ; Watchdog Window Timeout Period bit 2 position
.equ NVM_FUSES_WDWP3_bm = (1<<7) ; Watchdog Window Timeout Period bit 3 mask
.equ NVM_FUSES_WDWP3_bp = 7 ; Watchdog Window Timeout Period bit 3 position
.equ NVM_FUSES_WDP_gm = 0x0F ; Watchdog Timeout Period group mask
.equ NVM_FUSES_WDP_gp = 0 ; Watchdog Timeout Period group position
.equ NVM_FUSES_WDP0_bm = (1<<0) ; Watchdog Timeout Period bit 0 mask
.equ NVM_FUSES_WDP0_bp = 0 ; Watchdog Timeout Period bit 0 position
.equ NVM_FUSES_WDP1_bm = (1<<1) ; Watchdog Timeout Period bit 1 mask
.equ NVM_FUSES_WDP1_bp = 1 ; Watchdog Timeout Period bit 1 position
.equ NVM_FUSES_WDP2_bm = (1<<2) ; Watchdog Timeout Period bit 2 mask
.equ NVM_FUSES_WDP2_bp = 2 ; Watchdog Timeout Period bit 2 position
.equ NVM_FUSES_WDP3_bm = (1<<3) ; Watchdog Timeout Period bit 3 mask
.equ NVM_FUSES_WDP3_bp = 3 ; Watchdog Timeout Period bit 3 position

